In [1]:
#Pandas - Combinar Dataframes

In [5]:
import numpy as np
import pandas as pd

In [6]:
diccionario = { 'A': [1,2,3], 'B': [4,5,6], 'C': [7,8,9]}

In [8]:
dataframe1 = pd.DataFrame(diccionario)

In [9]:
dataframe1

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [10]:
diccionario2 = { 'A': [3,2,1], 'B': [21,12,12], 'C': [1231,12,3]}

In [11]:
dataframe2 = pd.DataFrame(diccionario2)

In [12]:
dataframe2

   A   B     C
0  3  21  1231
1  2  12    12
2  1  12     3

In [15]:
pd.concat([dataframe1,  dataframe2], axis=1)

   A  B  C  A   B     C
0  1  4  7  3  21  1231
1  2  5  8  2  12    12
2  3  6  9  1  12     3